; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph4 - mode
	image3 - mode
	infrared1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	GroundStation2 - direction
	Star4 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet5)
)
(:goal (and
	(pointing satellite1 Star3)
	(pointing satellite3 Planet5)
	(have_image Planet5 spectrograph0)
	(have_image Star6 infrared1)
	(have_image Planet7 spectrograph4)
	(have_image Star8 image3)
	(have_image Planet9 spectrograph4)
))

)

; plan
1. (turn_to satellite2 groundstation0 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation0)
   goals met: 1 of 7
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 7
3. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 1 of 7
4. (turn_to satellite2 planet5 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet5)
   goals met: 1 of 7
5. (take_image satellite2 planet5 instrument4 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 2 of 7
6. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 7
7. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 2 of 7
8. (turn_to satellite0 star6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star6)
   goals met: 2 of 7
9. (take_image satellite0 star6 instrument2 infrared1)
   added: (have_image star6 infrared1)
   goals met: 3 of 7
10. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 3 of 7
11. (take_image satellite0 star8 instrument2 image3)
   added: (have_image star8 image3)
   goals met: 4 of 7
12. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 4 of 7
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 7
14. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 7
15. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 4 of 7
16. (turn_to satellite0 planet7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet7)
   goals met: 4 of 7
17. (take_image satellite0 planet7 instrument1 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 5 of 7
18. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 5 of 7
19. (take_image satellite0 planet9 instrument1 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 6 of 7
20. (turn_to satellite1 star3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star3)
   goals met: 7 of 7
